app/Helpers/log_helper.php

    function registrar_log(string $acao): bool {
        try {
            $logModel = new \App\Models\LogModel();

            // Obtém dados do usuário logado
            $usuario_id = session()->get('user_id');

            // Prepara os dados para o log
            $dados_log = [
                'usuario_id' => $usuario_id,
                'acao' => strtoupper($acao),
                'created_at' => date('Y-m-d H:i:s'),
            ];

            // Insere o log
            return $logModel->insert($dados_log) !== false;
---
INSERT INTO `logs` (`usuario_id`, `acao`, `created_at`) VALUES ('2', 'LOGIN', '2025-11-10 17:42:40')