app/Controllers/Imoveis.php

    public function index()
    {
        try {
            $filtroBairro = $this->request->getGet('bairro');
            $filtroTipo = $this->request->getGet('tipo');
            $filtroFinalidade = $this->request->getGet('finalidade');

            $dados['imoveis'] = $this->model->getImoveisComDetalhes($filtroBairro, $filtroTipo, $filtroFinalidade) ?? [];

            // Busca bairros e tipos com tratamento de erro
            try {
                $dados['bairros'] = $this->bairroModel->findAll() ?? [];
---
SELECT *
FROM `bairros`