app/Models/ImovelModel.php

SELECT *
FROM `fotos_imoveis`
WHERE `imovel_id` = '4'
AND `capa` = 1
SELECT *
FROM `fotos_imoveis`
WHERE `imovel_id` = '4'
ORDER BY `ordem` ASC
 LIMIT 1
---
        $db = \Config\Database::connect();
        foreach ($resultado as &$imovel) {
            // Busca a foto de capa (marcada como capa = 1)
            $fotoCapa = $db->table('fotos_imoveis')
                ->where('imovel_id', $imovel['id'])
                ->where('capa', 1)
                ->get()
                ->getRowArray();

            // Se não tem capa definida, pega a primeira foto
            if (!$fotoCapa) {
                $fotoCapa = $db->table('fotos_imoveis')
                    ->where('imovel_id', $imovel['id'])
                    ->orderBy('ordem', 'ASC')
                    ->limit(1)
                    ->get()
                    ->getRowArray();