app/Models/UsuarioModel.php

SELECT *
FROM `usuarios`
WHERE `email` = 'marcio@gmail.com'
 LIMIT 1
---
    public function verifyPassword($email, $password)
    {
        $user = $this->where('email', $email)->first();